import os

os.chdir(r"Z:\DEV\py\atol_reader") # Рабочая папка
print(os.getcwd())

# Словарь АТОЛа
dict = {
'd00' : 'А', 'd01' : 'Б', 'd02' : 'В', 'd03' : 'Г', 'd04' : 'Д', 'd05' : 'Е', 'd06' : 'Ж', 'd07' : 'З', 'd08' : 'И', 'd09' : 'К', 'd0A' : 'Л', 'd0B' : 'М', 'd0C' : 'Н', 'd0D' : 'О',
'd0E' : 'П', 'd0F' : 'Р', 'd10' : 'С', 'd11' : 'Т', 'd12' : 'У', 'd13' : 'Ф', 'd14' : 'Х', 'd15' : 'Ц', 'd16' : 'Ч', 'd17' : 'Ш', 'd18' : 'Щ', 'd19' : 'Ъ', 'd1A' : 'Ы', 'd1B' : 'Ь',
'd1C' : 'Э', 'd1D' : 'Ю', 'd1E' : 'Я', 'd1F' : ' ', 'd20' : '!', 'd21' : '"', 'd22' : '№', 'd23' : '%', 'd24' : '&', 'd25' : '\'', 'd26' : '(', 'd27' : ')', 'd28' : '*', 'd29' : '+',
'd2A' : ',', 'd2B' : '-', 'd2C' : '.', 'd2D' : '/', 'd2E' : '0', 'd2F' : '1', 'd30' : '2', 'd31' : '3', 'd32' : '4', 'd33' : '5', 'd34' : '6', 'd35' : '7', 'd36' : '8', 'd37' : '9',
'd38' : ':', 'd39' : ';', 'd3A' : '<', 'd3B' : ':', 'd3C' : '>', 'd3D' : '?', 'd3E' : '@', 'd3F' : 'A', 'd40' : 'B', 'd41' : 'C', 'd42' : 'D', 'd43' : 'E', 'd44' : 'F', 'd45' : 'G',
'd46' : 'H', 'd47' : 'I', 'd48' : 'J', 'd49' : 'K', 'd4A' : 'L', 'd4B' : 'M', 'd4C' : 'N', 'd4D' : 'O', 'd4E' : 'P', 'd4F' : 'Q', 'd50' : 'R', 'd51' : 'S', 'd52' : 'T', 'd53' : 'U',
'd54' : 'V', 'd55' : 'W', 'd56' : 'X', 'd57' : 'Y', 'd58' : 'Z', 'd59' : '[', 'd5A' : '\\', 'd5B' : ']', 'd5C' : '^', 'd5D' : '_', 'd5E' : '`', 'd5F' : 'a', 'd60' : 'b', 'd61' : 'c',
'd62' : 'd', 'd63' : 'e', 'd64' : 'f', 'd65' : 'g', 'd66' : 'h', 'd67' : 'i', 'd68' : 'j', 'd69' : 'k', 'd6A' : 'l', 'd6B' : 'm', 'd6C' : 'n', 'd6D' : 'o', 'd6E' : 'p', 'd6F' : 'q',
'd70' : 'r', 'd71' : 's', 'd72' : 't', 'd73' : 'u', 'd74' : 'v', 'd75' : 'w', 'd76' : 'x', 'd77' : 'y', 'd78' : 'z', 'd79' : '{', 'd7A' : '|', 'd7B' : '}', 'd7C' : '~', 'd7D' : ' ',
'd7E' : 'а', 'd7F' : 'б', 'd80' : 'в', 'd81' : 'г', 'd82' : 'д', 'd83' : 'е', 'd84' : 'ж', 'd85' : 'з', 'd86' : 'и', 'd87' : 'к', 'd88' : 'л', 'd89' : 'м', 'd8A' : 'н', 'd8B' : 'о',
'd8C' : 'п', 'd8D' : 'р', 'd8E' : 'с', 'd8F' : 'т', 'd90' : 'у', 'd91' : 'ф', 'd92' : 'х', 'd93' : 'ц', 'd94' : 'ч', 'd95' : 'ш', 'd96' : 'щ', 'd97' : 'ъ', 'd98' : 'ы', 'd99' : 'ь',
'd9A' : 'э', 'd9B' : 'ю', 'd9C' : 'я', 'd9D' : '$', 'd9E' : '€', 'd9F' : '—', 'dA0' : ' ', 'dA1' : ' ', 'dA2' : ' ', 'dA3' : ' ', 'dA4' : ' ', 'dA5' : ' ', 'dA6' : ' ', 'dA7' : ' ',
'dA8' : ' ', 'dA9' : ' ', 'dAA' : ' ', 'dAB' : ' ', 'dAC' : ' ', 'dAD' : ' ', 'dAE' : ' ', 'dAF' : ' ', 'dB0' : ' ', 'dB1' : ' ', 'dB2' : ' ', 'dB3' : ' ', 'dB4' : ' ', 'dB5' : ' ',
'dB6' : ' ', 'dB7' : ' ', 'dB8' : ' ', 'dB9' : ' ', 'dBA' : ' ', 'dBB' : ' ', 'dBC' : ' ', 'dBD' : ' ', 'dBE' : ' ', 'dBF' : ' ', 'dC0' : ' ', 'dC1' : ' ', 'dC2' : ' ', 'dC3' : ' ',
'dC4' : ' ', 'dC5' : ' ', 'dC6' : ' ', 'dC7' : ' ', 'dC8' : ' ', 'dC9' : ' ', 'dCA' : ' ', 'dCB' : ' ', 'dCC' : ' ', 'dCD' : ' ', 'dCE' : ' ', 'dCF' : ' ', 'dD0' : ' ', 'dD1' : ' ',
'dD2' : ' ', 'dD3' : ' ', 'dD4' : ' ', 'dD5' : ' ', 'dD6' : ' ', 'dD7' : ' ', 'dD8' : ' ', 'dD9' : ' ', 'dDA' : ' ', 'dDB' : ' ', 'dDC' : ' ', 'dDD' : ' ', 'dDE' : ' ', 'dDF' : ' ',
'dE0' : ' ', 'dE1' : ' ', 'dE2' : ' ', 'dE3' : ' ', 'dE4' : ' ', 'dE5' : ' ', 'dE6' : ' ', 'dE7' : ' ', 'dE8' : ' ', 'dE9' : ' ', 'dEA' : ' ', 'dEB' : ' ', 'dEC' : ' ', 'dED' : ' ',
'dEE' : ' ', 'dEF' : ' ', 'df0' : 'Ё', 'df1' : 'ё', 'df2' : ' ', 'df3' : ' ', 'df4' : ' ', 'df5' : ' ', 'df6' : ' ', 'df7' : ' ', 'df8' : ' ', 'df9' : ' ', 'dfA' : ' ', 'dfB' : ' ',
'dfC' : ' ', 'dfD' : ' '}

# Словарь загружен?
print(dict['d10'], dict['d88'], dict['d6D'],dict['d80'], dict['d7E'], dict['d8D'], dict['d99'], dict['dA0'],dict['d85'], dict['d7E'], dict['d81'], dict['d8D'], dict['d77'], dict['d84'], dict['d83'], dict['d8A'], dict['d2C'], sep='')


flush = open('output.txt', 'w')
flush.close()



def convert(text):	# Обработка текста в строке
	output = open('output.txt', 'a', encoding='cp1251')
	header = text[0:20]
	if header[15] == '>': # Передан текст в строке?
		text = text[0:13] + '>>>> ' + text[21:]
		output.writelines(text)
	else:
	
	
	
		output.writelines(text)
		output.close()

file = open('logs.txt') # Передача строки на обработку
try:
	for row in file:
		convert(row)
finally:
	file.close()

	